define(["commSrc/comm"],function(){
	comm.langConfig['safetySettings'] ={
		errorCodes: {
			9998: "请求异常，请与管理员联系！",
			47000: "参数为null",
			47001: "参数为空字符串",
			47002: "参数类型错误",
			47003: "生成验证码错误",
			47100: "操作员数据库层错误",
			47101: "登录用户名已存在",
			47150: "登录用户名不存在",
			47151: "旧密码错误",
			47152: "登录验证码错误",
			47153: "登录验证码过期",
			47154: "登录令牌已失效",
			47155: "从请求中获取登录令牌失败",
			47200: "菜单数据库层错误",
			47250: "操作者没有分配角色",
			47300: "角色数据库层错误",
			47350: "用户组数据库层错误",
			47351: "用户组名称已经存在",
			47400: "操作者用户组关系数据库层错误",
			47450: "角色菜单关系数据库层错误",
			47500: "用户角色关系数据库层错误"
		}
	}
});
