define(['commSrc/comm'], function(){
	comm.langConfig['serviceMsgManage'] = {
		22000:'操作成功',
		22047:'申请编号不能为空',
		36601:"模板名称不能为空",
		36602:"模板类型不能为空",
		36603:"适用业务类别不能为空",
		36604:"适用客户类别不能为空",
		36605:"模板内容不能为空",
		36606:"模板内容格式不能为空",
		36607:"模板名称应为1~60个字",
		36608:"模板编号不能为空",
		36609:"未找到对应的模板",
		36610:"复核结果不能为空",
		36611:"备注信息应为0~300个字",
		36612:"操作类型不能为空",
		12495:"已存在相同类型的模板，不允许重复提交模板启用",
		12497:"模版名称重复",
		custTypes:{
			51:'非持卡消费者',
			1:'持卡消费者',
			2:'成员企业',
			3:'托管企业',
			4:'服务公司',
			5:'管理公司'
		},
		tsCustTypes:{
//			51:'非持卡消费者',
			1:'持卡消费者',
			2:'成员企业',
			3:'托管企业',
			4:'服务公司'
		},
		toBuyResRangeEnum : {//启用资源类型
			1:'首段资源',
			2:'创业资源',
			3:'全部资源',
			4:'正常资源',
			5:'免费资源'
		},
		tgToBuyResRangeEnum : {//托管企业-启用资源类型
			1:'首段资源',
			2:'创业资源',
			3:'全部资源'
		},
		cyToBuyResRangeEnum : {//成员企业-启用资源类型
			4:'正常资源',
			5:'免费资源'
		},
		tplStatus : {//模板状态--查询
			1:'待复核',
			2:'已启用',
			3:'待启用'
		},
		reqStatus : {//变更状态--查询
			4:'停用',
			5:'启用'
		},
		reviewResults : {//复核结果--查询
			1:'待复核',
			2:'复核通过',
			3:'复核驳回'
		},
		sendStatus : {//发送状态--查询
			1:'成功',
			0:'失败'
		},
		tplAllStatus : {//模板状态--显示
			1:'待复核',
			2:'已启用',
			3:'待启用',
			4:'待复核',
			5:'待复核'
		},
		busTypes : {//业务类型
			100:"订单自提码",
			101:"手机短信验证码",
			102:"申报企业成功",
			103:"申报企业授权码短信",
			104:"意外伤害保障生效",
			105:"意外伤害保障失效",
			106:"登录密码重置",
			107:"交易密码重置",
			108:"互生币账户告急",
			109:"互生币账户不足",
			110:"互生币账户偏少",
			111:"扣除年费成功",
			112:"扣除年费失败",
			113:"邮箱绑定验证",
			114:"密码找回验证",
			115:"符合互生医疗补贴",
			116:"申报服务公司进入办理期中",
			117:"交易密码重置授权码（申请驳回）",
			118:"交易密码重置授权码（申请通过）",
			119:"意外伤害保障失效"
		},
		sjBusTypes : {//业务类型--手机
			"1_":[104, 105, 115, 101, 100],//持卡消费者
			"2_4":[103, 102, 106, 107, 108, 109, 110, 101, 118, 117],//成员企业-免费资源类型
			"2_5":[103, 102, 106, 107, 108, 109, 110, 101, 118, 117],//成员企业-正常资源类型
			"3_1":[111, 112, 103, 102, 106, 107, 108, 109, 110, 101, 118, 117],//托管企业-首段资源
			"3_2":[111, 112, 103, 102, 106, 107, 108, 109, 110, 101, 118, 117],//托管企业-创业资源
			"3_3":[111, 112, 103, 102, 106, 107, 108, 109, 110, 101, 118, 117],//托管企业-全部资源
			"4_":[116, 118, 117, 111, 112, 103, 102, 106, 107, 101],//服务公司
			"5_":[106, 101],//管理公司
			"51_":[101, 100]//非持卡消费者
		},
		tsBusTypes : {//业务类型--推送
			"1_":[104, 105, 115],//持卡消费者
			"2_4":[108, 109, 110],//成员企业-免费资源类型
			"2_5":[108, 109, 110],//成员企业-正常资源类型
			"3_1":[108, 109, 110, 111, 112],//托管企业-首段资源
			"3_2":[108, 109, 110, 111, 112],//托管企业-创业资源
			"3_3":[108, 109, 110, 111, 112],//托管企业-全部资源
			"4_":[116, 111, 112],//服务公司
			"5_":[],//管理公司
			"51_":[104, 105, 115]//非持卡消费者
		},
		yjBusTypes : {//业务类型--邮件
			"1_":[113, 114],//持卡消费者
			"2_4":[113, 114],//成员企业-免费资源类型
			"2_5":[113, 114],//成员企业-正常资源类型
			"3_1":[113, 114],//托管企业-首段资源
			"3_2":[113, 114],//托管企业-创业资源
			"3_3":[113, 114],//托管企业-全部资源
			"4_":[113, 114],//服务公司
			"5_":[113, 114],//管理公司
			"51_":[113, 114]//非持卡消费者
		},
		buyResTypeCantNotBeNull : "启用资源类型不能为空"
	}
});