define([ "commSrc/comm" ], function() {
	comm.langConfig['accountResult'] = {
		// 共用
		22000 : "操作成功",
		22001 : "操作失败",
		22003 : "参数错误",
		22004 : "token令牌无效",
		23801 : "数据没找到",
		0 : "处理成功",
		34024 : "订单号不能为空",
		34025 : "复核帐号不能为空",
		34026 : "复核密码不能为空",
		34027 : "复核意见不能为空",
		requestError : '请求出错，请重试！',
		begin_Date : '请输入开始日期',
		end_Date : '请输入结束日期',
		digits : '请输入整数',
		maxlength : '最多输入{0}个字符',
		kjrq : '请选择快捷日期',
		ywlb : '请选择业务类别',
		PayStatus : {
			0 : "待支付",
			1 : "处理中",
			2 : "已付款"
		},
		category : {
			0 : "中成药",
			1 : "西药",
			2 : "手术费",
			3 : "检查费",
			4 : "材料费",
			5 : "其他"
		},
		unit : {
			0 : "盒",
			1 : "瓶",
			2 : "袋",
			3 : "床",
			4 : "例",
			5 : "片",
			6 : "个",
			7 : "套",
			8 : "条",
			9 : "克",
			10 : "千克"
		},
		OrderStatus : {
			1 : "待付款 ",
			2 : "待配货",
			3 : "已完成",
			4 : "已过期",
			5 : "已关闭"
		}
	}
});