define(["commSrc/comm"], function () {
	comm.langConfig["hsbAccount"] = {
			//错误毛描述
			22000:'操作成功', 
			22004 : "token令牌无效",
			22006 : "客户号不能为空",
			22007 : "登录token不能为空",
			30004 : "客户名不能为空",
			30011 : "转出互生币的数量错误",
			30002 : "交易密码不能为空",
			30003 : "互生币数量不能为空",
			12009:'超出互生币支付限额',
			30010 : "互生币转出数量大于可转数量，请重新输入！",
			30012 : "请输入8位交易密码",
			30013 : "互生币转货币金额必须为大于100的正整数",
			30014 : "转出货币金额不能为空",
			30015 : "实际转入数量 不能为空",
			30016 : "货币转换费不能为空",
			30017 : "转出互生币不能为空",
			30018 : "转入货币金额不能为空",
			160360 : "交易密码错误",
			160150 : "交易密码错误",
			22006 : "获取验证码失败",
			22007 : "付款失败",
			15102 : "验证码不正确，请点击获取验证码",
			9998  : "验证码不正确，请点击获取验证码",
			30184 : "提交订单失败",
			160102 : "该持卡人客户号找不到对应客户信息",
			30128 : "验证码过期",
			30024 : "验证码错误",
			160360 : "交易密码不正确",
			160415 : "交易密码未设置",
			160146 : "数据解密错误",
			160411 : "交易密码连续出错导致用户锁定",
			15000 : "银行卡号输入错误",
			44000 : "支付限额值不能为空",
			13007 : "余额不足",
			30203 : "请设置单笔支付限额开关",
			30204 : "单笔支付限额值错误",
		    30205 : "请设置每日支付限额开关",
			30206 : "每日支付限额值错误",
			30207 : "单笔互生币支付限额超出平台限制",
			30208 : "每日互生币支付限额超出平台限制",
			22053 : "验证码不能为空",
			22061 : "验证码已过期",
			22052 : "验证码错误",
			11011:"数据不存在",
			22070 : "交易流水号错误",
			22071 : "支付方式错误",
			accountManage_sendSmsSucc : '短信验证码发送成功',
			randomTokenInvalid:"获取随机报文失败，请重试",
			affireHsbToCash : "确认申请互生币转货币",
			hsbToCashSuccess : "互生币转货币操作成功",
			quickPaySucc : '快捷支付成功',
			quickPayFail : '快捷支付失败',
			quickPayProcessing : '兑换互生币快捷支付处理中',
			pleaseSelectQuick : '请先阅读《快捷支付服务协议》并同意',
			affireBuy : "确认要购买吗",
			smsCode:'请填入手机验证码',
			bankNo:'请填入银行卡号',
			bankNoLength:'请输入16-19位银行卡号',
			selectBandQuickBank:"请选择绑定快捷支付的银行账户",
			sendSmsCode : "请先获取手机验证码。",
		hsbBuy : {
			//兑换互生币
			required : "金额不能为空",
			digits2 : "请输入数字！",
			numLen : "请输入6位数字！",
			digits : "请输入最多两位小数的值",
			min : "兑换互生币数量不能小于{0}",
			max : "兑换互生币数量不能大于{0}",
			maxlength : "最多输入{0}位数",
			greater : "单笔兑换数量为500-5000的最多两位小数的值",
			less : "单笔兑换数量为500-5000的整数",
			dealPwd : "请输入交易密码",
			dealPwdLength : "请输入{0}位交易密码",
			setPassword  : "请至安全设置菜单设置交易密码",
			affireBuy : "确认要购买吗",
			convertHsb  :"兑换互生币",
			passwordCheckFail  : "交易密码验证错误!",
			passwordCheckFails  : "交易密码验证错误!",
			importMoneyError   :  "输入金额错误",
			convertHsbSubmit: "兑换互生币提交！",
			affirmBuy      : "确认要购买吗",
			pay : "支出",
			income : "收入",
			dayMinAmount:"每日互生币支付限额不能小于单笔互生币支付限额",
			dayMaxAmount:"单笔互生币支付限额不能大于每日互生币支付限额",
			singleMinAmount:"单笔互生币支付限额必须大于0",
			alarm1 : "您未实名注册，兑换互生币数量为{0}至{1}，请正确输入兑换数量！",
			alarm2 : "兑换互生币数量为{0}至{1}，请正确输入兑换数量！",
			alarm3 : "您当日兑换互生币数量已达到上限值，请明天再进行兑换",
			alarm4 : "您当日可兑换互生币余额为{0}，请重新输入兑换互生币数量",
			singleAmount:"请输入单笔互生币支付限额数",
			dayAmount:"请输入每日互生币支付限额数",
			minAmount : "支付限额最小值不能低于{0}"
		},
		detailSearch : {
			//积分投资明细查询
			quickDateRequired : "请至少选择一个科目",
			quickDateMinlength : "请至少选择一个科目",
			beginDateRequired : "请输入开始时间",
			beginDateError : "开始时间输入有误",
			beginDateEnd : "开始日期不能大于结束日期",
			endDateRequired : "请输入结束时间",
			endDateError : "结束时间输入有误",
			endDateBegin : "结束日期不能小于开始日期"
		},
		
		zfxesz_pwd : {
			required : "交易密码不能为空"	
		},
		zfxesz_code : {
			required : "验证码不能为空"	
		},
		dbhsbzfxe_add : {
			required : '必填'
		},
		mrhsbzfxe_add : {
			required : '必填'
		},
		mrhsbzfxzcs_add : {
			required : '必填'
		},
		pwd_add : {
			required : '必填'
		},
		code_add : {
			required : '必填'	
		},
		// 互生币类型
		hsbAccTypeEnum : {
			"20110" : "流通币",
			"20120" : "定向消费"
		},
		// 业务类别
		businessTypeEnum : {
			"0" : "全部",
			"1" : "收入",
			"2" : "支出"
		},
		// 交易类型
		transTypeEnum : {
		    "K13000":"货币兑换互生币",
		    "K14000":"网银兑换互生币",
		    "S22000" :"补办互生卡",
		    "S22100" :"补办互生卡退款",
		    "S24100" :"补办互生卡退款",
		    "M32000" :"互生币转货币",
		    "M52000" :"代兑互生币",
		    "M82000" :"代兑互生币",
		    "M92000" :"代兑互生币",
		    "M11000" :"积分转互生币",
		    "T11000" :"积分投资",
		    "T36000" :"投资分红",
		    "W10000" :"意外伤害补贴",
		    "W30000" :"互生医疗补贴",
		    "W20000" :"他人身故补贴",
		    "X10630" : "系统调账转出",
		    "X10530" : "系统调账转入",
		    "S72000" : "平台业务扣款",
		    "X11000" : "系统平账",
		    "X14000" : "系统平账"
		},
		transResult : {
			0 : '等待付款',
			1 : '交易成功',
			2 : '冲正撤单',
			3 : '交易失败',
			4 : '过期失效'
		},
		channel : {
			1 : '网页终端',
			2 : '移动终端',
			3 : '移动终端',
			4 : 'POS终端'
		},
		orderStatus :{
			1 : '待付款',
			2 : '待配货',
			3 : '已完成',
			4 : '已过期',
			5 : '已关闭',
			6 : '待确认',
			7 : '已撤单',
			8 : '支付处理中',
		},
		dhhsb : {
			'100' : "您输入的卡号无效",
			'003' : "您的发卡银行不支持该商户，请更换其他银行卡",
			'006' : "您的卡已经过期，请使用其他卡支付",
			'011' : "您卡上的余额不足",
			'014' : "您的卡已过期或者是您输入的有效期不正确",
			'015' : "您输入的银行卡密码有误",
			'021' : "您输入的验证信息有误",
			'039' : "您已连续多次输入错误密码",
			'040' : "您的银行卡暂不支持在线支付业务，请向您的银行咨询如何加办银联在线支付",
			'041' : "您的银行不支持快捷支付",
			'042' : "您的银行不支持小额支付",
			'043' : "您的银行不支持快捷支付",
			'057' : "该银行卡未开通银联在线支付业务",
			'060' : "银行卡未开通快捷支付",
			'074' : "对不起，该操作只能在交易当日进行",
			'084' : "验证码错误或者已失效，请重新获取验证码",
			'085' : "不支持短信发送",
			'086' : "短信验证码错误",
			'087' : "您的短信发送过于频繁，请稍候再试",
			'088' : "您的短信发送累计过于频繁，请在5分钟后重试",
			'089' : "对不起，短信发送失败，请稍候再试",
			'095' : "您尚未在邮储银行网点柜面或个人网银签约加办银联无卡支付业务，请去柜面或网银开通",
			'097' : "请致电您的银行以确定您的用户信息是否设置正确，并咨询是否已经开办银联在线支付"
		}
	
	}
});