define([ "commSrc/comm" ], function() {
	comm.langConfig["workopt"] = {
		// 共用
		22000 : "操作成功",
		22001 : "操作失败",
		22003 : "参数错误",
		22004 : "token令牌无效",
		23801 : "数据没找到",
		0 : "处理成功",
		9996:"参数为空",
		checkTypeEnum : {
			1 : "密码验证",
			2 : "指纹验证",
			3 : "刷卡验证"
		},
		inp_len_err:"字符不能超过{0}字符串",
		sel_chk_tp_err:"请选择验证方式",
		36047 : "工单号不能为空",
		36048 : "原因信息不能为空",
		36049 : "工单编号不能为空",
		34025 : "复核帐号不能为空",
		34026 : "复核密码不能为空",
		34027 : "复核意见不能为空",
		36304 : "派单模式不能为空",
	    36305 : "指定值班员不能为空",
	    36306 : "工单编号不能为空",
	    13100 : "参数不能为空",
	    13107 : "更新任务状态异常",
	    13119 : "操作异常",
	    13120 : "更新操作异常",
	    13132 : "未查询到当前工单号对应的记录 ",
	    160102 : "用户名查询不到操作员信息",
	    24003 : "审批单不存在",
	    42162 : "没有操作员可办理此业务"
	};

});
