define(['commSrc/comm'], function(){
	comm.langConfig['businessService'] = {
		requestError : '请求错误',
		32707 : '申请编号不能为空',
		32708 : '未指明审批结果',
		12003 : '服务公司审批成员企业失败',
		12001 : '业务类型[bizType]错误',
		12331 : '发票金额必须大于应开发票金额',
		12339 : '该业务类型的发票金额已开完',
		12340 : '消费积分扣除累计金额至少1000元才可开发票',
		35104 : "企业客户号不能为空",
		35105 : "企业互生号不能为空",			
		35106 : "企业名称不能为空",	
		35107 : "发票金额不能为空",
		35108 : "银行支行名称不能为空",			
		35109 : "银行银行账号不能为空",			
		35110 : "地址不能为空",			
		35111 : "电话不能为空",			
		35112 : "纳税人识别号不能为空",			
		35113 : "开票内容不能为空",			
		35114 : "业务类型不能为空",			
		35115 : "快递公司名称不能为空",			
		35116 : "运单号不能为空",			
		35117 : "发票ID不能为空",		
		35118 : "发票状态不能为空",
		35119 : "开票方不能为空",
		35120 : "开票金额太大",
		35121 : "必须一次性开完发票",
		35122 : "至少录入一条发票记录",
		35123 : "发票类型不能为空",
		35124 : "发票代码不能为空",
		35125 : "发票金额不能为空",
		35126 : "发票号码不能为空",
		160101 : "该互生号找不到对应的客户号",
		160355 : "必传参数为空",
		12333 : "开票金额太大",
		12017 : "银行支行名称为空",
		12305 : "企业客户号对应的年费信息不存在",
		select_invoice_type:"请选择发票类型",
		9996 : "参数错误，请稍后重试",
		12344 : "发票已签收,请勿重复签收",
		/** 待服务公司审批 **//*
	    WAIT_TO_APPROVE(0),
	    *//** 待地区平台审批 **//*
	    SERVICE_APPROVED(1),
	    *//** 待地区平台复核 **//*
	    PLAT_APPROVED(2),
	    *//** 地区平台复核通过 **//*
	    PLAT_APPROVAL_REVIEWED(3),
	    *//** 服务公司审批驳回 **//*
	    SERVICE_REJECTED(4),
	    *//** 地区平台审批驳回 **//*
	    PLAT_REJECTED(5),
	    *//** 地区平台复核驳回 **//*
	    PLAT_REVIEW_REJECTED(6),
	    *//** 查询用组合状态：待地区平台审批(包含待地区平台审批与待地区平台复核) **//*
	    COMBO_WAIT_PLAT_APPR(12),
	    *//** 查询用组合条件：地区平台审批驳回(包含地区平台审批驳回与地区平台复核驳回) **//*
	    COMBO_PLAT_REJECTED(56),*/
	    
		
		//服务公司审批停止参与积分活动查询条件状态
		appStatusEnum : {
			0:'待服务公司审批',
			12:'待地区平台审批',
			4:'服务公司审批驳回',
			3:'地区平台审批通过',
			56:'地区平台审批驳回'
		},
		
		//服务公司审批停止参与积分活动显示状态
		appStatusShowEnum : {
			0:'待服务公司审批',
			1:'待地区平台审批',
			2:'待地区平台审批',
			3:'地区平台审批通过',
			4:'服务公司审批驳回',
			5:'地区平台审批驳回',
			6:'地区平台审批驳回'
		},
		//发票配送类型
		delivery_status : {
			0:  "全部",
			2 : "已开票 ",
			3 : "已配送",
			4 : "已签收 ",
			5 : "拒签"
		},
		invoice_status : {
			0:  "申请中",
			1 : "驳回 ",
			2 : "已开票 ",
			3 : "已配送 ",
			4 : "已签收 ",
			5 : "拒签"
		},
		receive_way : {
			0 : "物流单号确认签收 ",
			1 : "电话确认签收 ",
			2 : "到期自动签收"
		},
		post_way : {
			0 : "快速配送",
			1 : "自由配送 "
		},
		invoice_type : {
			1 : "增值税普通发票",
			0 : "增值税专用发票"
		},
		bizType :{
			'PC001' : '服务公司系统资源费',
			'PC002' : '申购工具',
			'PC003' : '系统使用年费',
			'PC004' : '外卖月租费',
			'PC005' : '消费积分',
			'PC006' : '个性卡制定服务费',
			'PC007' : '成员企业系统资源费',
			'PC008' : '首段托管企业系统资源费',
			'PC009' : '创业托管企业系统资源费',
			'PC010' : '托管企业系统资源费(全部资源)',
			'PC011' : '其他段托管企业系统资源费',
			'PC012' : '企业向平台开发票总业务/包括所有业务'
		},
		selectPostWay:"请选择配送方式",
		enterExpressName:"请输入承运公司",
		entertrackingNo:"请输入运单号",
		determine : '确定',
		cancel : '取消',
		query : '查看',
		approval : '审批',
		wait_approval:'待服务公司审批',
		apprRemarkNotNull:"审批信息不能为空",
		select_reportFile_error:"请选择企业实地考察报告文件",
		select_statementFile_error:"请选择企业双方声明文件",
		//注销审批查询条件状态
		cancelApplyStatueEnum:{ //注销审批状态
			0:'待服务公司审批',
			12:'待地区平台审批',
			4:'服务公司审批驳回',
			3:'成员企业资格已注销',
			56:'地区平台审批驳回'
		},
		//注销审批显示状态
		cancelApplyShowStatueEnum:{ //注销审批状态
			0:'待服务公司审批',
			1:'待地区平台审批',
			2:'待地区平台审批',
			3:'成员企业资格已注销',
			4:'服务公司审批驳回',
			5:'地区平台审批驳回',
			6:'地区平台审批驳回'
		}
		
	}
});