define([ "commSrc/comm" ], function() {
	comm.langConfig['receivablesmanage'] = {
		// 共用
		22000 : "操作成功",
		22001 : "操作失败",
		22003 : "参数错误",
		22004 : "token令牌无效",
		23801 : "数据没找到",
		0 : "处理成功",
		34024 : "订单号不能为空",
		34025 : "复核帐号不能为空",
		34026 : "复核密码不能为空",
		34027 : "复核意见不能为空",
		requestError : '请求出错，请重试！',
		begin_Date : '请输入开始日期',
		end_Date : '请输入结束日期',
		digits : '请输入整数',
		maxlength : '最多输入{0}个字',
		kjrq : '请选择快捷日期',
		ywlb : '请选择业务类别',
		15102 : '要查询的记录不存在',
		35101 : '选择的记录中有银行支付单号不存在 ',
		OrderType : {
			100 : "缴纳系统使用年费",
			//101 : "资源费分配",
			101 : "系统资源费",
			102 : "兑换互生币",
			103 : "新增申购工具",
			104 : "售后工具维修费",
			105 : "补办互生卡",
			/*106 : "互生卡重新制作",*/
			107 : "个性卡定制服务费",
			108 : "缴纳积分预付款",
//			109 : "申报申购工具",
			110 : "系统资源申购"
		},
		PayChannel : {
			100 : "网银支付",
			101 : "手机网银支付",
			102 : "快捷支付",
			200 : "互生币支付",
			300 : "货币账户支付",
			400 : "转账汇款"
		},
		PayStatus : {
			0 : "待付款",
			1 : "处理中",
			2 : "已付款",
			3 : "付款失败"
		},
		PayStatusForShow : {
			0 : "未付款",
			1 : "未付款",//处理中
			2 : "已付款",
			3 : "未付款"//付款失败
		},
		OrderStatus : {
			1 : "待付款 ",
			2 : "待配货",
			3 : "已完成",
			4 : "已过期",
			5 : "已关闭"
		},
		currencyCN : {
			'CNY':'人民币',
			'HSB':'互生币',
			'156':'人民币'
		},
		/** 双签类型 */
		checkTypeEnum : {
			1 : "密码验证",
			2 : "指纹验证",
			3 : "刷卡验证"
		},
		reconciliationStatus:{//对账状态
			0:"失败",
			1:"成功"
		},
		paymentStatus:{	//付款状态
			0 : "未付款",
			2 : "已付款"
		},
		businessPayStatus:{	//业务订单付款状态
			0 : "未付款",
			1 : "未付款",
			2 : "已付款",
			3 : "未付款"
		},
		selectPayStatus:{	//业务订单付款状态
			'0,1,3' : "未付款",
			'2' : "已付款"
		}
		
	}
});