define(["commSrc/comm"],function(){
	comm.langConfig['accountCompany'] ={
		//共用 
		begin_Date: '请输入开始日期',
		end_Date : '请输入结束日期',
		digits: '请输入整数',
		maxlength: '最多输入{0}个字',
		kjrq: '请选择快捷日期',
		ywlb:'请选择业务类别',
		//预缴积分预付款
		yjzfyfk_yfk: '请输入预缴金额',
		yjzfyfk_less: '预缴预付积分最低数1000',
		yjzfyfk_pwd: "请输入交易密码",
		//积分转货币
		jfzhb_zcjfs:'请输入转出积分数',
		jfzhb_jyzzh:'转入货币账户交易子账户',
		jfzhb_jymm:'请输入8位交易密码',
		mxcx_datail : '详情',
		mxcx_ck : '查看',
		ent_type : 2,
		//
		quickDateEnum : {//快捷日期类别
			'today':'今天',
			'week':'最近一周',
			'month':'最近一月'
		},
		businessEnum : {//业务类别
			'0':'全部',
			'1':'收入',
			'2':'支出'
		},
		hsbAccTypeEnum : {//账户类型
			'20110':'流通币',
			'20130':'慈善救助基金'
		},
		taxRateTypeEnum : {// 税收业务列别
			10510 : "积分税收",
			20610 : "互生币税收",
			30310 : "货币(人民币)税收"
		},
		transResult : {
			'-1' : '未提交银行',
			'1000' : '提现成功',
			'1001' : '提现失败',
			'1002' : '银行处理中',
			'1003' : '被退票'
		},
		bzType : {//币种类型
			'CNY':'人民币'
		},
		//账户类型
		accountType:{
			'10110':'积分账户',
			'20110':'流通币账户',
			'10410':'积分投资账户',
			'20120':'定向消费币',
			'30110':'货币账户',
			'10510':'积分税收账户'
		},
		years : {
			2008	:	2008,
			2009	:	2009,
			2010	:	2010,
			2011	:	2011,
			2012	:	2012,
			2013	:	2013,
			2014	:	2014,
			2015	:	2015,
			2016	:	2016,
			2017	:	2017,
			2018	:	2018,
			2019	:	2019,
			2020	:	2020,
			2021	:	2021,
			2022	:	2022,
			2023	:	2023,
			2024	:	2024,
			2025	:	2025,
			2026	:	2026,
			2027	:	2027,
			2028	:	2028,
			2029	:	2029,
			2030	:	2030
		},
		dataNotExist:'未查询到详单数据',
		11011 : '未查询到详单数据',
		// 交易类型
		transTypeEnum : {
		    "S12000":"申购工具付款",
		    "S32000":"申购工具付款",
		    "S42000":"申购工具付款",
		    "S62000":"申购工具付款",
		    "S82000":"申购工具付款",
		    "S12100":"申购工具退款",
		    "S14100":"申购工具退款",
		    "S15100":"申购工具退款",
		    "S32100":"申购工具退款",
		    "S34100":"申购工具退款",
		    "S35100":"申购工具退款",
		    "S82100":"申购工具退款",
		    "S84100":"申购工具退款",
		    "S85100":"申购工具退款",
		    
		    "S52000":"缴纳系统使用年费",
		    "K23000":"货币兑换互生币",
		    "K23020":"货币兑换互生币",
		    "K24000":"网银兑换互生币",
		    "K25000":"线下兑换互生币",
		    "K34000":"托管企业首段资源网银申报",
		    "K44000":"托管企业创业资源网银申报",
		    "K54000":"托管企业全部资源网银申报",
		    "K35000":"托管企业首段资源临账申报",
		    "K45000":"托管企业创业资源临账申报",
		    "K55000":"托管企业全部资源临账申报",
		    "K64000":"成员企业网银申报",
		    "K65000":"成员企业临账申报",
		    "K74000":"服务公司申报网银支付",
		    "K75000":"服务公司临账申报",
		    "M42000":"互生币转货币",
		    "M52000":"代兑互生币",
		    "M21000" :"积分转互生币",
		    "T21000":"积分投资",
		    "T46000":"投资分红",
		    "U26000" :"积分再增值分配",
		    "U16000" :"积分互生分配",
		    "U56000":"申报兑换互生币",
		    
		    "L23000":"货币转银行",
		    "L43000" :"货币转银行手续费",
		    "L23100":"货币转银行撤单",
		    "L43100":"货币转银行撤单",
		    "L23200":"货币转银行失败转入",
		    "L43200":"货币转银行失败转入",
			
			"G24000":"消费积分退货",
			"G23000":"消费积分撤单",
			"S32100":"互生币支付撤单",
		    
		    "G14000" : "商业服务费",  
		    "G15000" : "商业服务费",  
		    "G20000" : "消费积分分配",
		    "G11000" : "商城销售结算",
		    "G12000" : "线下销售结算",
		    "G30000" : "商业服务费税收",
		    "G41000" : "积分分配收入(商城)",
		    "G42000" : "积分分配收入(线下)",
		    "G50000" : "积分分配收入税收",
		    "G50100" : "退积分税收(退货)",
		    "G21000": "消费积分分配",
		    "510000": "月租服务费",
		    "X10630": "系统调账转出",
		    "X10530": "系统调账转入",
		    "S72000": "平台业务扣款",
		    "U46000" : "管理费收入",
		    "U36000" : "劳务费",
		    "X11000" : "系统平账",
		    "X14000" : "系统平账",
		    "X13000" : "预付款退回",
		    "X16000" : "预付款转入",
		    "X15000" : "代兑手续费收入",
		    "K82000" : "预缴积分预付款",
		    "K84000" : "预缴积分预付款",
		    "K85000" : "预缴积分预付款",
		    "X11000" : "预付款平账转出",
		    "M71000" : "积分转货币",
		    "X17000" : "预付款平账"
		},
		custType :{
			2 : '成员企业',
			3 : '托管企业',
			4 : '服务公司'
		}
	}
});
