define(["commSrc/comm"],function(){
	comm.langConfig['accountPersonFckr'] ={
		//共用 
		begin_Date: '请输入开始日期',
		end_Date : '请输入结束日期',
		digits: '请输入整数',
		maxlength: '最多输入{0}个字',
		kjrq: '请选择快捷日期',
		ywlb:'请选择业务类别',
		//预缴积分预付款
		yjzfyfk_yfk: '请输入预缴金额',
		yjzfyfk_less: '预缴预付积分最低数1000',
		yjzfyfk_pwd: "请输入交易密码",
		//积分转货币
		jfzhb_zcjfs:'请输入转出积分数',
		jfzhb_jyzzh:'转入货币账户交易子账户',
		jfzhb_jymm:'请输入8位交易密码',
		
		businessEnum : {//业务类别
			'0':'全部',
			'1':'收入',
			'2':'支出'
		},
		quickDateEnum : {//快捷日期类别
			'today':'今天',
			'week':'最近一周',
			'month':'最近一月'
		},
		//互生币账户
		hsbAccount:'20110',
		//货币账户
		hbAccount:'30110',
		// 交易类型
		transTypeEnum : {
			"K13000":"货币兑换互生币",
		    "K14000":"网银兑换互生币",
		    "S22000" :"补办互生卡",
		    "S22100" :"补办互生卡退款",
		    "S24100" :"补办互生卡退款",
		    "M32000" :"互生币转货币",
		    "M52000" :"代兑互生币",
		    "M82000" :"代兑互生币",
		    "M92000" :"代兑互生币",
		    "M11000" :"积分转互生币",
		    "T11000" :"积分投资",
		    "T36000" :"投资分红",
		    "W10000" :"意外伤害补贴",
		    "W30000" :"免费医疗补贴",
		    "W20000" :"他人身故补贴",
		    "M61000" :"积分转货币",
			"M32000" :"互生币转货币",
			"L13000" :"货币转银行",
			"L13100" :"货币转银行撤单",
			"L13200" :"货币转银行失败转入",
			"L33000" :"货币转银行手续费",
			"L33200" :"货币转银行失败转入",
		    "X10630" : "系统调账转出",
		    "X10530" : "系统调账转入",
		    "S72000" : "平台业务扣款",
		    "X11000" : "系统平账",
		    "X14000" : "系统平账"
		}
	}
});
