define([ "commSrc/comm" ], function() {
	comm.langConfig['callCenter'] = {
		// 共用
		22000 : "操作成功",
		22001 : "操作失败",
		22003 : "参数错误",
		22004 : "token令牌无效",
		23801 : "数据没找到",
		0 : "处理成功",
		34024 : "订单号不能为空",
		34025 : "复核帐号不能为空",
		34026 : "复核密码不能为空",
		34027 : "复核意见不能为空",
		requestError : '请求出错，请重试！',
		begin_Date : '请输入开始日期',
		end_Date : '请输入结束日期',
		digits : '请输入整数',
		maxlength : '最多输入{0}个字',
		kjrq : '请选择快捷日期',
		ywlb : '请选择业务类别',
		OrderType : {
			100 : "系统使用年费",
			101 : "资源费分配",
			102 : "兑换互生币",
			103 : "购买工具",
			104 : "售后服务",
			105 : "个人补卡",
			106 : "企业重做卡",
			107 : "定制卡样费用"
		},
		PayChannel : {
			100 : "网银支付",
			101 : "手机移动支付",
			102 : "快捷支付",
			200 : "互生币支付",
			300 : "货币支付",
			400 : "转账汇款"
		},
		PayStatus : {
			0 : "待支付",
			1 : "处理中",
			2 : "已付款"
		},
		OrderStatus : {
			1 : "待付款 ",
			2 : "待配货",
			3 : "已完成",
			4 : "已过期",
			5 : "已关闭"
		},
		/**
		 * 互生卡补卡状态
		 */
		hsCardOrderStatus : {
			1 : "待付款",
			2 : "待配货",
			3 : "已完成 ",
			4 : "已过期",
			5 : "已关闭",
			6 : "待确认 ",
			7 : "已撤单"
		},
		DealStatus:{
			1:"处理中",
			2:"已完成",
			3:"无效单"
		},
		CallerType:{
			1:"运维类",
			2:"商务类",
			3:"诉建类"
		}
	}
});