define([ "commSrc/comm" ], function() {
	comm.langConfig["pointWelfare"] = {
		24001 : '必传参数为空',
		24008 : '该持卡人消费积分累积达到300分',
		24012 : '已存在相同的申请单',
		24009 : '调用工单系统错误',
		24013 : '申请人不能跟身故人为同一人',
		24014 : '您已经在代此身故人申请身故保障金了，处理中！',
		24015 : '已有其他人在代此身故人申请身故保障金了，处理中！',
		24016 : '此身故人的身故保障金已经受理成功，不能重复受理',
		24017 : '您的意外保障金余额已发放完了',
		30198 : '被保障人为企业，不享受积分福利',
		30199 : '被保障人没有实名认证',
		30200 : '被保障人没有绑定手机号码',
		30201 : '被保障人互生卡号跟姓名不一致',
		30202 : '被保障人互生卡号不存在',
		160102 : '被保障人互生卡号不存在',
		
		mobileNotBind : '此业务办理需绑定手机号码，请先绑定手机号码!',
		noRealNameAuth : '此业务办理需实名认证，请先实名认证！',
		noRealNameReg : '此业务办理需实名注册，请先实名注册！',
		deathResNoIsSameOfApplyer : '申请人跟身故人不能为同一人',
		
		applyStatus:{
			0:'受理中',
			1:'受理成功',
			2:'驳回'
		},
	
		/** 互生医疗补贴计划提示* */
		medicalSubsidyScheme : {
			cardNum : "请输入医保号码",
			cardNumError : "请输入正确的医保号码",
			startDate : "请输入诊疗起始日期",
			gtEndDate : "起始日期不能大于终止日期",
			endDate : "请输入诊疗终止日期",
			lsBeginDate : "终止日期不能小于起始日期",
			/*所在城市*/
			city : "请输入所在城市",
			/*所在医院*/
			hospital : "请输入所在医院",
			/*互生卡正面*/
			hscPositive : "请上传互生卡正面图片",
			/*互生卡背面*/
			hscReverse : "请上传互生卡背面图片",
			/*身份证正面*/
			cerPositive : "请上传身份证件正面图片",
			/*身份证背面*/
			cerReverse : "请上传身份证件背面图片",
			/*原始收费收据复印件*/
			ofr : "请上传原始收费复印件",
			/*费用明细清单复印件*/
			cdl : "请上传费用明细清单复印件",
			/*门诊病例复印件*/
			omr : "请上传门诊病例复印件",
			/*病例诊断书复印件*/
			ddc :"请上传病例诊断书复印件"
		},
		/** 意外伤害保障验证提示* */
		accidentInsurance : {
			hscPositive : "请上传互生卡正面图片",
			hscReverse : "请上传互生卡背面图片",
			cerPositive : "请上传身份证正面图片",
			cerReverse : "请上传身份证背面图片",
			medicalProve : "请上传医疗证明",
			medicalAccept : "请上传医保中心的受理回执 图片",
			costCount : "请上传医疗费用报销计算表 图片",
			ssc : "请上传消费者本人的社会保障卡 图片",
			imr : "请上传住院病历复印件",
			ofr : "请上传原始收费收据复印件",
			ddc : "请上传诊断证明书复印件",
			cdl : "请上传费用明细清单复印件",
			/* 申请成功 */
			applySuccess : "您的互生意外伤害保障申请提交成功"
		},
		/** 身故保障提示* */
		deathInsurance : {
			/* 被保障人互生卡号 */
			deathResNo : "请输入被保障人互生卡号",
			/* 被保障人姓名 */
			diePeopleName : "请输入被保障人姓名",
			/* 被保障人死亡证明附件 */
			deathProve : "请上传死亡证明附件",
			/* 户籍注销证明 */
			hrc : "请上传户籍注销证明",
			/* 与被保障人关系证明书 */
			ifp : "请输入与被保障人关系证明书",
			/* 代办人法定身份证明 */
			aip : "请输入代办人法定身份证明",
			/* 申请成功 */
			applySuccess : "您代他人申请身故保障金申请提交成功"
		},
		detailSearch : {
			// 明细查询
			welfareType : "请选择申请福利类别",
			statusType : "请选择状态"
		}
	}
});