define([ "commSrc/comm" ], function() {
	comm.langConfig['resouceManage'] = {
		// 共用
		22000 : "操作成功",
		22001 : "操作失败",
		22003 : "参数错误",
		23901 : "参数错误",
		22004 : "token令牌无效",
		22005 : "互生号不能为空",
		33249 : "所属省份不能为空",
		33250 : "所属城市不能为空",
		0 : "处理成功",
		160355 : "参数错误，请稍后再试！",
		requestError : '请求出错，请重试！',
		begin_Date : '请输入开始日期',
		end_Date : '请输入结束日期',
		kjrq : '请选择快捷日期',
		ywlb : '请选择业务类别',
		select_pompt:"请选择",
		realnameAuthEnum : {// 实名认证状态枚举
			1 : "已认证",
			0 : "未认证"
		},
		participationScoreEnum : {// 参与积分状态枚举
			2 : "参与积分",
			1 : "停止积分 ",
		},
		entStatusEnum : {// 企业状态枚举
			1:'正常',
			2:'预警',
			3:'休眠',
			4:'长眠',
			5:'已注销',
			6:'申请停止积分活动中',
			7:'停止积分',
			8:'注销办理中'
		},
		creTypeEnum : {// 证件类型
			1 : "身份证", 
			2 : "护照",
			3 : "营业执照"
		},
		entTypeEnum:{//企业类型
			2:"成员企业",
			3:"托管企业",
			4:"服务公司"
			
		}
		
	}
});
