define(["commSrc/comm"],function(){
	comm.langConfig['messageCenter'] ={
			//共用 
			9996 : '接收单位内容有误，请核对信息',
			23801 : '接收单位内容有误，请核对信息',
			32701 : '消息标题不能为空',
			32702 : '消息内容不能为空',
			32703 : '请输入或选择接收消息的单位',
			32704 : '当前操作需要消息信息的ID编号',
			32709 : '消息标题超过允许的最大长度100',
			32710 : '消息摘要不能为空',
			32711 : '消息摘要最长不超过100个字',
			32712 : '消息类型不能为空',
			32713 : '消息级别不能为空',
			32714 : '消息接受者不能为空',
			32715 : '发送互生号不能为空',
			32716 : '发送企业客户号不能为空',
			32717 : '发送企业名称不能为空',
			32718 : '创建者不能为空',
			32719 : '发送者不能为空',
			32720 : '是否发送不能为空',
			32721 : '更新者不能为空',
			chakan : '查看',
			xiugai : '修改',
			del : '删除',
			confirmMessageCenterTitle:'删除确认',
			confirmMessageCenterDelete:'确定删除选择的消息？',
			selectDelMsg:"请选择",
			sendSuccess:"发送成功",
			saveSuccess:"保存成功",
			receiptor : {
				'ALL' : 	'关联的全体客户',
				'ALL_M' : 	'全体下级管理公司',
				'ALL_S' : 	'全体下级服务公司',
				'ALL_T' : 	'全体下级托管企业',
				'ALL_B' : 	'全体下级成员企业',
				'ALL_P' : 	'全体下级消费者',
				'M_ALL_S' : '全体下级服务公司',
				'S_ALL_T' : '全体下级托管企业',
				'S_ALL_B' : '全体下级成员企业',
				'S_ALL' : 	'全体下级企业'
			},
			msgtype : {
				11 : '公告',
				12 : '公开信',
				20 : '私信'
			},
			msglevel : {
				1 : '一般',
				2 : '重要'
			}
	}
});