define(["commSrc/comm"], function() {
	comm.langConfig["platformDebit"] = {
		// 后台返回的状态码
		22000 : "操作成功",
		22001 : "操作失败",
		30101 : "互生号不能为空",
		36541 : "扣款业务类型只支持消费者、成员企业、托管企业、服务公司",
		36542 : "扣款对应的互生号不存在",
		160102 : "扣款对应的互生号不存在",
		160203 : "持卡人未注册",
		160355 : "参数错误，请稍后再试",
		36542 : "扣款对应的互生号不存在",
		36543 : "扣款互生号不能为空",
		36544 : "扣款单位名称不能为空",
		36545 : "扣款客户操作号不能为空",
		36546 : "扣款金额格式错误",
		34524 : "客户类型不能为空",
		13013 : "扣款互生币账户余额不足",
		12901 : "申请扣款失败，请稍后再试",
		12011 : "申请扣款失败，请稍后再试",
		36547 : "扣款原因长度不能超过3000个字符",
		36550 : "扣款互生号不存在！",
		36551 : "余额不足,扣款申请失败！",
		quickDateEnum:{//快捷日期
			'today' : "近一日",
			'week' : "近一周",
			'month' : "近一月",
			'month3' : "近三月"
		},
		deductionStatusEnum:{ //扣款状态
			0 : "扣款待复核",
			1 : "扣款成功",
			2 : "驳回扣款申请"
		},
		apprStatusEnum:{ //复核状态
			1 : "复核成功",
			2 : "复核驳回"
		}
	}
});