define([ "commSrc/comm" ], function() {
	comm.langConfig["shutdownsystem"] = {
		// 后台返回的状态码
			22000 : "操作成功",
			22001 : "操作失败",
			160121:	"该企业互生号不存在",

			35100 : "税率申请编号不能为空",
			
			35101 : "税率申请状态不能为空",
			
			35102 : "审批意见不能为空",
			
			35103 : "审批人不能为空",
			
			35104 : "企业客户号不能为空",
			35105 : "企业互生号不能为空",			
			35106 : "企业名称不能为空",	
			35107 : "发票金额不能为空",
			35108 : "银行支行名称不能为空",			
			35109 : "银行银行账号不能为空",			
			35110 : "地址不能为空",			
			35111 : "电话不能为空",			
			35112 : "纳税人识别号不能为空",			
			35113 : "开票内容不能为空",			
			35114 : "业务类型不能为空",			
			35115 : "快递公司名称不能为空",			
			35116 : "运单号不能为空",			
			35117 : "发票ID不能为空",
			
			35118 : "发票状态不能为空",
			
			35119 : "开票方不能为空",
			
			35120 : "开票金额太大",
			
			35121 : "必须一次性开完发票",
			35122 : "至少录入一条发票记录",
			35123 : "发票类型不能为空",
			
			160101 : "该企业客户号找不到企业信息",
			
			160355 : "必传参数为空",
			
			12333 : "除了消费积分扣除，其他发票申请必须与剩余金额相同",
			
			13202:  "字符参数不是数字类型",
			12331 : "该业务类型的发票金额已开完",
			12017:  "参数为空",
			12699: "存在正在审批的开关系统申请,请不要重复申请",
			select_review_type:"请选择",
		status : {
			0 : "开启",
			1 : "关闭"
		},
		applystatus : {
			0 : "开启",
			1 : "申请",
			2 : "通过",
			3 : "驳回"
		},
		custType :{
			2 : '成员企业',
			3 : '托管企业',
			4 : '服务公司'
		},
		applyType :{
			1 : '关闭系统',
			2 : '开启系统'
		},
		oldType :{
			1 : '开启',
			2 : '关闭'
		},
		apprResult	:{
			'true' : '申请已通过',
			'false': '申请已驳回'
		},
		determine : '确定',
		cancel : '取消',
		query : '查看',
		approval : '审批',
		edit : '修改',
		reqRemarkReired:'申请说明不能为空',
		remarkLength:'最长不超过300个字',
		refuseApproval:'您正在拒绝受理开关系统复核业务的工单!',
		suspendApproval:'您正在挂起开关系统复核业务的工单！',
		suspendSucess:'已挂起此业务工单',
		refuseSucess:'已拒绝受理此业务工单！',
		apprRemarkReired:'复核说明不能为空'
	}
});