define(["commSrc/comm"],function(){
	comm.langConfig['businessHandling'] ={
			//共用 
			32705 : '交易密码不能为空',
			32706 : '订单编号不能为空',
			160415: '交易密码未设置',
			12305 : "年费信息不存在",
			12007 : "获取快捷支付短信验证码：未查询到数据",
			160203:	"持卡人未注册",
			11010 : '余额不足',
			12311 : '对应的年费业务订单不存在',
			12007 : '获取快捷支付短信验证码：未查询到数据',
			160360: '交易密码错误',
			9996 : ' 互生币金额错误',
			22001 : "操作失败",
			15100 : "已经处理成功，不能重复提交",
			13007 : "余额不足",
			15100 : "订单已经处理成功，不能重复提交",
			12405: "订单已支付",
			
			transPassNotNull : '请输入交易密码',
			trans_pass8 : '交易密码长度为8位',
			paysuccess : '缴纳系统使用年费成功！',
			tishi : '提示',
			chakan : '查看',
			//订单状态
			jnsh_ddzt : {
				1 : '待付款',
				2 : '待配货',
				3 : '已付款',
				4 : '已过期',
				5 : '已关闭'
			},
			jnsh_ddzt2 : {
				1 : '待付款',
				3 : '已付款'
			},
			//订单渠道
			orderChannel : {
				1 : '网页终端',
				2 : '移动终端',
				3 : '经营平台',
				4 : 'POS终端'
			},
			//系统业务订单-订单类型
			jnsh_ddlx : {
				100 : '缴纳系统使用年费',
				101 : '资源费分配',
				102 : '兑换互生币',
				103 : '购买工具',
				104 : '售后服务',
				105 : '个人补卡',
				106 : '企业重做卡',
				107 : '定制卡样',
				108 : '缴纳积分预付款'
			},
			//支付方式
			jnsh_zffs : {
				100 : '网银支付',
				101 : '手机移到支付',
				102 : '快捷支付',
				200 : '互生币支付',
				300 : '货币支付',
				400: '转账汇款'
			},
			universal : {
				today : '今天',
				current_week : '最近一周',
				current_moth : '最近一月'
			},
			//银行卡类型
			toolManage_bankCardType :{
				1:'储蓄卡',
				2:'信用卡'	
			},
			title_hsb : '互生币支付-缴纳系统使用年费订单详情',
			title_annualfeeorder : '缴纳系统使用年费订单详情',
			title_wy : '网银支付-缴纳系统使用年费订单详情',
			toolManage_selectBandQuickBank : '请现在绑定快捷支付的银行卡',
			toolManage_sendSmsSucc : '短信验证码发送成功',
			toolManage_quickPaySucc : '快捷支付成功',
			toolManage_quickPayFail : '快捷支付失败',
			toolManage_quickPayProcessing : '快捷支付处理中',
			trans_pass8: '交易密码长度为8位!',
			dealPwdLength : "请输入8位交易密码",
			inputTradePwd:"请输入交易秘密",
			22070 : "交易流水号错误",
			22071 : "支付方式错误"
	}
});