define(["commSrc/comm"],function(){
	comm.langConfig['systemManage'] ={
		
		subSystemCode : 'MCS',
		platformCode : 'HSXT',
		
		//角色类型1：全局:2：平台:3：私有
		roleType : "3",
		
		username : "请输入正确的用户名,例如：0000",
		passwordLogin : "登录密码需6位且只能是数字",
		usernamebt:"姓名不能为空",
		
		33301:"企业客户号不能为空",
	    33302:"企业互生号不能为空",
	    33303:"用户名（员工账号）不能为空",
	    33304:"初始登录密码不能为空",
	    33305:"管理员客户号不能为空",
	    33306:"操作员客户号不能为空",
	    33307:"用户组描述不能为空",
	    33308:"用户组名称不能为空",
	    33309:"用户组编号不能为空",
	    33310:"角色描述不能为空",
	    33311:"角色名称不能为空",
	    33312:"角色编号不能为空",
	    33313:"权限不能为空",
	    
	    
	    33314 : "角色名称在20个字符内",
	    33315 : "角色描述在100个字符内",
	    33316 : "用户组名称在15个字符内",
	    33317 : "用户组描述在300个字符内",
	    33318 : "操作员姓名在20个字符内",
	    33319 : "操作员职务在10个字符内",
	    33320 : "操作员描述在100个字符内",
	    33321 : "请输入正确的手机号码",
	    
	    33324:"确认登录密码不能为空",
	    33325:"两次输入密码不一致",
	    
	    160382 : "此用户组已存在",
	    160103 : "用户已存在",
	    160426 : "角色使用中，禁止删除!",
	    160427 : "角色已经存在!",
	    160429 : "不能删除有组员的用户组",
	    160437:"角色使用中，禁止删除",
	    
	    accountStatus : {
	    	0 : "启用",
	    	1 : "停用"
	    },
	    
		update : "修改",
		del : "删除",
		activity : "启用",
		unactivity : "停用",
		isActivity : "确认启用此操作员？",
		isUnActivity : "确认停用此操作员？",
		delContent : "确认删除选中的记录？",
		groupUser : "组员维护",
		nullUserCustId : "未选者任何用户！",
		remove : "移除",
		confirRemoveUser: "您确认移除选择的用户?",
		confirAddUser : "您确认将选择的用名添加到用户组？",
		grantRole : "角色设置",
		menuPower : "菜单授权",
		pwd_number_repeated_error:"密码不规范:数字不能全部重复 。如111111、222222",                
		pwd_increase_error:"密码不规范:数字不能顺增或顺降。例123456、234567",
		resetPwdSuccess:"重置密码成功",
		resetPwdTitle:"重置登录密码"
		
	}
});
