define(['commSrc/comm'], function(){
	comm.langConfig['certificateManage'] = {
			
			36401: "企业互生号不能为空",

			36402: "企业客户号不能为空",

			36403: "企业客户名称不能为空",

			36404: "企业客户类型不能为空",

			36405: "启用资源类型不能为空",

			36406: "操作员客户号不能为空",

			36407: "合同编号不能为空",

			36408: "唯一识别号不能为空",

			36409: "模板名称不能为空",

			36410: "模板内容不能为空",

			36411: "模板编号不能为空",

			36412: "审批结果不能为空",

			36413: "证书编号不能为空",
			
			36414: "证书模板图片不能为空",
			
			36415: "证书模板文件不能为空",
			
			36416: "创建者客户号不能为空",
			
			12011: "只有服务公司和托管企业两种类型有证书",
			12000: "参数错误",
			12685: "保存证书模板失败",
			12706: "系统操作异常",
			12713: "存在同类型处于已启用状态或停用待复核状态的模版",
			templetFileError : "模板文件必须是htm或者html文件",
			custTypeInvalid :	"适用企业类型不能为空",
			zsSendRemarkError: "证书发放说明不能为空",
			zsRecvRemarkError: "证书回收说明不能为空",
			printStatusEnum : {
				'true' : '已打印',
				'false' : '未打印'
			},
			sendStatusEnum : {
				'true' : '已发放',
				'false' : '未发放'
			},
			sealStatusEnum : {
				0	:	'未盖章',
				1	:	'已盖章',
				2	:	'已失效',
				3	:	'须重新盖章'
			},
			sealStatusSelector : {
				0	:	'未盖章',
				1	:	'已盖章',
				3	:	'须重新盖章'
			},
			templetTypeEnum : {
				2	:	'第三方业务证书模版',
				3	:	'销售资格证书模版'
			},
			custTypeEnum : {
				2	:	'成员企业',
				3	:	'托管企业',
				4	:	'服务公司'
			},
			resTypeEnum : {
				1	:	'首段资源',
				2	:	'创业资源',
				3	:	'全部资源',
				4	:	'正常资源',
				5	:	'免费资源'
			},
			TResTypeEnum : {
				//1	:	'首段资源',
				2	:	'创业资源'
				//3	:	'全部资源'
			},
			BResTypeEnum : {
				4	:	'正常资源',
				5	:	'免费资源'
			},
			templetStatusEnum : {
				0	:	'已启用',
				1	:	'待启用',
				2	:	'待启用复核',
				3	:	'待停用复核'
			},
			passStatusEnum :{
				'true'	:	'复核通过',
				'false'	:	'复核驳回'
			},
			custTypeSelector : {
				3	:	'托管企业',
				4	:	'服务公司'
			}
	};
});