define([ "commSrc/comm" ], function() {
	comm.langConfig["debit"] = {
		// 后台返回的状态码
			22000 : "操作成功",
			22001 : "操作失败",

			// 收款帐户
			12000 : "实体类参数为空",
			12304 : "帐户类型参数错误",
			9998 : "发生未知错误",
			35001 : "帐户类型参数错误",
			35002 : "帐户类型参数不能为空",
			35003 : "收款账户名称不能为空",
			35004 : "收款账户简称不能为空",
			35005 : "账户户名编号不能为空",
			35006 : "收款开户行名称不能为空",
			35007 : "收款账号不能为空",
			35008 : "银行名称不能为空",
			35009 : "收款银行不能为空",

			35010 : "付款金额不能为空",
			35011 : "付款方式不能为空",
			35012 : "付款方式不匹配",
			35013 : "付款企业名称不能为空",
			35014 : "付款银行名称不能为空",
			35015 : "付款银行账号不能为空",
			35016 : "收款账户信息id不能为空",
			35017 : "到账时间不能为空",
			35018 : "创建人不能为空",
			35019 : "付款时间不能为空",
			35020 : "临账ID不能为空",
			35021 : "复核/驳回备注",
			35022 : "临帐状态不能为空",
			35023 : "审批人不能为空",
			35024 : "订单号不能为空",
			35025 : "关联总额不能为空",
			35026 : "订单金额不能为空",
			35027 : "申请备注不能为空",
			35028 : "付款用途不能为空",
			35029 : "退款金额不能为空",
			35030 : "至少选择一个临账",
			35031 : "临账关联金额不能为空",
			35032 : "转不动款说明不能为空",
			35033 : "复核意见不能为空",
			35034 : "复核员账号不能为空",
			35035 : "复核人密码不能为空",
			35036 : "请选择一种验证方式",
			35037 : "付款时间不能大于到账时间",
			35038 : "拟用企业互生号为11位",
			35039 : "请输入正确的金额格式",
			12356:  "同收账户名称同收款账号同银行名称的账户信息已存在",
			12370:  "同类型的账户名称已存在",
			12357:  "临账关联当前订单申请已受理，请勿重复申请",
		accountType : {
			1 : '收款账户',
			2 : '节余不动款账户'
		},
		quickDate : {
			'today' : 'getTodaySE',
			'week' : 'getWeekSE',
			'month' : 'getMonthSE'
		},
		applyStatus : {
			0 : "待审批",
			1 : "地区平台初审通过",
			2 : "地区平台复审通过",
			3 : "审批未通过"
		},
		bankList : {
			1 : "工商银行",
			2 : "农业银行",
			3 : "中国银行",
			4 : "建设银行"
		},
		payType : {
			'1' : 'POS机刷卡',
			'2' : '银行汇款',
			'3' : '现金付款'
		},
		payUse : {
			'1' : '申报付款',
			'2' : '申购工具',
			'3' : '缴纳系统使用年费',
			'4' : '兑换互生币',
			'5' : '互生卡重新制作',
			'6' : '个性卡制定服务费',
			'7' : '新增申购系统资源'
		},
		debitStatus : {
			0 : "录入待复核 ",
			1 : "待关联 ",
			2 : "关联待复核 ",
			3 : "已关联",
			4 : "录入复核驳回",
			5 : "待退款 ",
			6 : "已退款 ",
			7 : "不动款"
		},
		isActive : {
			'Y' : '正常',
			'N' : '禁用'
		},
		orderType : {
			100 : "缴纳系统使用年费",
			101 : "系统资源费",
			102 : "兑换互生币",
			103 : "新增申购工具",
		/*	106 : "互生卡重新制作",*/
			107 : "个性卡定制服务费",
			108 : "缴纳积分预付款",//2.0数据用
			110 : "系统资源申购"
		},
		orderStatus : {
			1 : "待付款 ",
			2 : "待配货",
			3 : "已完成",
			4 : "已过期",
			5 : "已关闭",
			6 : "待确认",
			7 : "已撤单",
			8 : "支付处理中"
		},
		orderChannel :{
			1 : "网页终端 ",
			2 : "移动终端",
			3 : "经营平台",
			4 : "POS终端"
		},
		payChannel  :{
			100 : "网银支付 ",
			101 : "手机移动支付",
			102 : "快捷支付",
			200 : "互生币支付",
			300 : "货币支付",
			400 : "转账汇款"
		},
		categoryCode:{
			P_POS:'POS机',
			TABLET:'互生平板', 
			POINT_MCR:'积分刷卡器',
			CONSUME_MCR:'消费刷卡器',
			P_CARD:'互生卡', 
			NORMAL:'普通工具',
			GIFT:'赠品', 
			SUPPORT:'配套产品'
		},
		auditRecordRangelength : '复核信息不能超过300个字',
		determine : '确定',
		cancel : '取消',
		query : '查看',
		approval : '审批',
		edit : '修改',
		apprStatus:{
			1:"审批通过",
			2:"审批驳回"
		},
		bankNo_format_error:"请输入正确银行账号"
		
	}
});