define(["commSrc/comm"],function(){
	comm.langConfig['accountPerson'] ={
		//共用 
		begin_Date: '请输入开始日期',
		end_Date : '请输入结束日期',
		digits: '请输入整数',
		maxlength: '最多输入{0}个字',
		kjrq: '请选择快捷日期',
		ywlb:'请选择业务类别',
		//预缴积分预付款
		yjzfyfk_yfk: '请输入预缴金额',
		yjzfyfk_less: '预缴预付积分最低数1000',
		yjzfyfk_pwd: "请输入交易密码",
		//积分转货币
		jfzhb_zcjfs:'请输入转出积分数',
		jfzhb_jyzzh:'转入货币账户交易子账户',
		jfzhb_jymm:'请输入8位交易密码',
		mxcx_datail : '详情',
		mxcx_ck : '查看',
		per_type : 1,
		//
		quickDateEnum : {//快捷日期类别
			'today':'今天',
			'week':'最近一周',
			'month':'最近一月'
		},
		payModel:{
			100 : "网银支付",
			101 : "手机移动支付",
			102 : "快捷支付",
			200 : "互生币支付",
			300 : "货币支付",
			400 : "转账汇款(临帐)"
		},
		channel : {
			1 : '网页终端',
			2 : '移动终端',
			3 : '移动终端',
			4 : 'POS终端'
		},
		businessEnum : {//业务类别
			'0':'全部',
			'1':'收入',
			'2':'支出'
		},
		hsbAccTypeEnum : {//账户类型
			'20110':'流通币',
			'20120':'定向流通币'
		},
		taxRateTypeEnum : {// 税收业务列别
			10510 : "积分税收",
			20610 : "互生币税收",
			30310 : "货币(人民币)税收"
		},
		transResult : {
			'-1' : '未提交银行',
			'-99':'失败',
			'1000' : '提现成功',
			'1001' : '提现失败',
			'1002' : '银行处理中',
			'1003' : '被退票'
		},
		bzType : {//币种类型
			'CNY':'人民币'
		},
		//账户类型
		accountType:{
			'10110':'积分账户',
			'20110':'流通币账户',
			'10410':'积分投资账户',
			'20120':'定向消费币',
			'30110':'货币账户',
			'10510':'积分税收账户'
		},
		years : {
			2008	:	2008,
			2009	:	2009,
			2010	:	2010,
			2011	:	2011,
			2012	:	2012,
			2013	:	2013,
			2014	:	2014,
			2015	:	2015,
			2016	:	2016,
			2017	:	2017,
			2018	:	2018,
			2019	:	2019,
			2020	:	2020,
			2021	:	2021,
			2022	:	2022,
			2023	:	2023,
			2024	:	2024,
			2025	:	2025,
			2026	:	2026,
			2027	:	2027,
			2028	:	2028,
			2029	:	2029,
			2030	:	2030
		},
		dataNotExist:'未查询到详单数据',
		11011:'未查询到详单数据',
		//明细详情标题
		detailedTitle:{
			'M21000':'企业积分转互生币详情',
			'T21000':'企业积分投资详情',
			'M42000':'企业互生币转货币详情',
			'K23000':'企业货币兑换互生币详情',
			'L23100':'企业银行转账撤单详情',
			"M42000":"企业互生币转货币详情",
			"K23000":"企业货币兑换互生币详情",
			"L23000":"企业转账预转出详情",
			"L23200":"企业转账失败退回详情",
			"L43200":"企业转账银行退票退回",
			"L23100":"企业银行转账撤单",
			"U36000":"劳务费收入详情",
			"M71000":"积分转货币详情"
		},
		// 交易类型
		transTypeEnum : {
			"K13000":"货币兑换互生币",
		    "K14000":"网银兑换互生币",
		    "S22000" :"补办互生卡",
		    "S22100" :"补办互生卡退款",
		    "S24100" :"补办互生卡退款",
		    "M32000" :"互生币转货币",
		    "M52000" :"代兑互生币",
		    "M82000" :"代兑互生币",
		    "M92000" :"代兑互生币",
		    "M11000" :"积分转互生币",
		    "T11000" :"积分投资",
		    "T36000" :"投资分红",
		    "W10000" :"意外伤害补贴",
		    "W30000" :"免费医疗补贴",
		    "W20000" :"他人身故补贴",
		    "M61000" :"积分转货币",
			"M32000" :"互生币转货币",
			"L13000" :"货币转银行",
			"L13100" :"货币转银行撤单",
			"L13200" :"货币转银行失败转入",
			"L33000" :"货币转银行手续费",
			"L33200" :"货币转银行失败转入",
		    "X10630" : "系统调账转出",
		    "X10530" : "系统调账转入",
		    "S72000" : "平台业务扣款",
		    "X11000" : "系统平账",
		    "X14000" : "系统平账"
		}
	}
});
