define(["commSrc/comm"],function(){
	comm.langConfig['systemBusiness'] ={
		22001:"操作失败",
		9999 :'请求失败,请稍后重试',	
		22068: "未查询到企业信息",
		9998 :'请求失败,请稍后重试',	
		23804 :'请求失败,请稍后重试',	
		9996 :'操作非法,参数错误',
		22040:'客户类型不能为空',
		22005:'互生号不能为空',
		22006:'客户号不能为空',
		22042:"交易密码不能为空",
		22043: "银行卡号不能为空",
		22044: "银行卡类型不能为空",
		22045: "银行编号不能为空",
		22046: "银行卡号错误",
		23804: "初始化地区平台信息未找到",
		22041:'客户名称不能为空',
		12003 :'系统异常,请稍后重试',
		22037 :'操作员客户号不能为空',
		12022 :'系统异常,请稍后重试',
		160149 : '非法用户类型',
		19201 : '文件服务系统连接失败',
		19204 : 'Token失效',
		12002 : '申请成员企业注销失败',
		160147 : '企业不存在',
		12001 : '业务类型[bizType]错误',
		12331 : '发票金额必须大于等于应开发票金额',
		12339 : '该业务类型的发票金额已开完',
		12657 : "欠款开启系统资源费未归还",
		12340 : '消费积分扣除累计金额至少1000元才可开发票',
		35104 : "企业客户号不能为空",
		35105 : "企业互生号不能为空",			
		35106 : "企业名称不能为空",	
		35107 : "发票金额不能为空",
		35108 : "银行支行名称不能为空",			
		35109 : "银行银行账号不能为空",			
		35110 : "地址不能为空",			
		35111 : "电话不能为空",			
		35112 : "纳税人识别号不能为空",			
		35113 : "开票内容不能为空",			
		35114 : "业务类型不能为空",			
		35115 : "快递公司名称不能为空",			
		35116 : "运单号不能为空",			
		35117 : "发票ID不能为空",
		12636 : "存在正在审批的重要信息变更",
		12638 : "该企业存在未完成的订单",
		12616 : "存在正在审批的重要信息变更",
		22069: "业务操作失败,请稍后重试",
		43295  :"企业重要信息变更期间,不允许代兑互生币",
		35118 : "发票状态不能为空",
		
		35119 : "开票方不能为空",
		
		35120 : "开票金额太大",
		
		35121 : "必须一次性开完发票",
		35122 : "至少录入一条发票记录",
		35123 : "发票类型不能为空",
		35124 : "发票代码不能为空",
		35125 : "发票金额不能为空",
		35126 : "发票号码不能为空",
		
		160101 : "该互生号找不到对应的客户号",
		
		160355 : "必传参数为空",
		
		12333 : "开票金额太大",
		
		160452 :"该角色已被操作员使用，不能删除！",
	    160453 : "该角色已授权菜单，不能删除！",
		
		13202:  "字符参数不是数字类型",
		12017:  "参数为空",
		12002: '未查询到企业信息',
		160360 :'交易密码错误',
		160359 :'登录密码错误',
		160108 :'登录密码错误',
		12111:'工具订单提交失败',
		12112:'工具订单提交失败',
		12119:'工具订单支付处理中,稍等支付结果',
		12120 :'工具订单已支付',
		12121 :'工具订单已关闭或已失效 ',
		12122 :'工具订单支付失败',
		12197 :'工具订单关闭失败',
		12473 :'工具订单支付失败',
		12128:'工具订单撤单失败',
		12131:'工具订单撤单失败',
		12199 : '订单不是待付款或待确认，不能取消或关闭',
		12466:'工具订单操作失败',
		31018:'工具服务类型不能为空',
		31019:'工具配置单不能为空',
		31020:'工具收货地址不能为空',
		31021:'操作非法,解析工具订单参数错误',
		31022:"工具支付方式不能为空",
		31023:"工具订单号不能为空",
		31024:"短信验证码不能为空",
		31025:"快捷签约号不能为空",
		31026:"设备类型不能为空",
		31027:"设备号不能为空",
		31028:"设备状态不能为空",
		12127:'上传企业卡制作卡样确认文件失败',
		12305 : "当前企业还没有产生年费信息",
		12007 : "获取快捷支付短信验证码：未查询到数据",
		160203:	"持卡人未注册",
		
		99901 : '流通币账户未开通或不存在',
		99902 : '货币账户未开通或不存在',
		99903 : '货币转换费账户未开通或不存在',
		99904 : '积分预付款账户未开通或不存在',
		22037 : '操作员客户号不能为空',
		22055:'登录密码不能为空',
		22008:'随机token不能为空',
		31033:'收货人不能为空',
		31034:'省编号不能为空',
		31035:'城市编号不能为空',
		31036:'收货详细地址不能为空',
		31037:'手机号码不能为空',
		31038:'收货地址编号不能为空',
		160415:'交易密码未设置,请先设置交密码',
		160411:'交易密码连续出错导致用户锁定',
		31093:'收货地址不能为空',
		31094: "收货人不能为空",
		31095: "收货地址编号不能为空",
		31096: "工具类别代码不能为空",
		31097: "工具编号不能为空",
		31098: "工具名称不能为空",
		31099: "工具价格不能为空",
		31100:"工具数量不能为空",
		13007:'互生币账户余额不足',
		31101:'申请原因不能为空',
		31103:'已超过您设置的互生币的支付限额',
		12009:'已超过您设置的互生币的支付限额',
		
		160102: "不能找到对应的客户信息，请检查输入的卡号",
		31114: '不能找到对应的客户信息，请检查输入的卡号',
		31117: "企业重要信息变更期间,不允许代换互生币",
		31119:"欠年费不能进行此业务",
		15100 : "订单已经处理成功，不能重复提交",
		31300:'应付积分大于互生币账户余额',
		31125: "企业已注销,没有交易权限",
		31126: "申请停止积分活动中,没有交易权限",
		31127: "积分活动已停止,没有交易权限",
		31128: "企业注销申请中,没有交易权限",
		15000:'获取网银支付链接失败',
		12405:'订单已支付',
		31109:'持卡人号码不能为空',
		31111:'本币金额不能为空',
		31134: "企业申请注销失败",
		31135: "企业网上商城有未完结订单，不允许注销。",
		22022: "获取地区信息失败",
		31136: "企业网上商城有未完结订单，不允许停止积分活动。",
		
		31143: "企业有未结算的预付定金的交易",
		31142: "企业有未结单的交易",
		
		11005: '网上积分登记积分数不能小于0.1',
		11006: '账户余额不足',
		11007: '抵扣券金额不得大于消费金额的50%',
		11001: '抵扣券金额不得大于消费金额的50%',
		11010 : '余额不足',
		11039: "消费积分支付失败，请重试！",
		11040: "消费积分支付失败，请重试！",
		11041: "消费积分支付失败，请重试！",
		11042: "消费积分支付失败，请重试！",
		11043: "消费积分支付失败，请重试！",
		11044: "消费积分支付失败，请重试！",
		11045: "抵扣券金额不足，请重试！",
		11046: "抵扣券金额不足，请重试！",
		11047: "消费积分支付失败，请重试！",
		11048: "消费积分支付失败，请重试！",
		11049: "抵扣券张数超过限制的数量",
		11050: "抵扣券金额不得大于消费金额的50%",

		//共用 
		requestError: '请求出错，请重试！',
		//修改属性页  状态不能为空
		xgsxStatusNotNull: '请选择修改状态！',
		transPassNotNull : '请输入交易密码',
		trans_pass8: '交易密码长度为8位!',
		//网上积分登记 互生卡号不能为空
		wsjfdj_resNoNotNull : '请填写互生卡号',
		//网上登记积分 消费金额不能为空
		wsjfdj_consumFeeNotNull : '请填写消费金额',
		//消费金额必须为有效数字
		wsjfdj_consumMustNum : '请填写有效的金额数字',
		//网上登记积分 积分比例必选
		wsjfdj_pointNumSelect : '请选择积分比例',
		//网上登记积分 积分比例设置
		wsjfdj_pointNumSet : '请先进行网上积分登记积分比例设置',
		//代兑互生币最小额度
		amount_min:'代兑金额最少为100',
		//代兑互生币最小额度
		amount_regex:'代兑金额格式为带零到两位小数的数字',
		reasonRangelength:"申请原因字符必须在{0}~{1}字符以内",
		
		hsbBuy : {
			//兑换互生币
			required : "金额不能为空",
			digits : "请输入整数",
			huobi : "输入值最多为2位小数",
			min : "兑换互生币数量不能小于{0}",
			max : "兑换互生币数量不能大于{0}",
			maxlength : "最多输入{0}位数",
			greater : "单笔兑换数量为500-5000的整数",
			less : "单笔兑换数量为500-5000的整数",
			dealPwd : "请输入交易密码",
			dealPwdLength : "请输入{0}位交易密码",
			setPassword  : "请至安全设置菜单设置交易密码",
			affireBuy : "确认要购买吗",
			convertHsb  :"兑换互生币",
			passwordCheckFail  : "交易密码验证错误!",
			passwordCheckFails  : "交易密码验证错误!",
			importMoneyError   :  "输入金额错误",
			convertHsbSubmit: "兑换互生币提交！",
			affirmBuy      : "确认要购买吗",
			pay : "支出",
			income : "收入",
			dayMinAmount:"每日互生币支付限额不能小于单笔互生币支付限额",
			dayMaxAmount:"单笔互生币支付限额不能大于每日互生币支付限额",
			singleMinAmount:"单笔互生币支付限额必须大于0",
			alarm1 : "该卡号未实名注册，兑换互生币数量为{0}至{1}，请正确输入兑换数量！",
			alarm2 : "兑换互生币数量为{0}至{1}，请正确输入兑换数量！",
			alarm3 : "该卡号当日兑换互生币数量已达到上限值，请明天再进行兑换",
			alarm4 : "该卡号当日可兑换互生币余额为{0}，请重新输入兑换互生币数量",
			alarm5 : "您互生币账户余额不足",
			singleAmount:"请输入单笔互生币支付限额数",
			dayAmount:"请输入每日互生币支付限额数",
			minAmount : "支付限额最小值不能低于{0}"
		},
		/** 工具申购 **/
		//工具类别
		toolManage_categoryCode:{
			P_POS:'POS机',
			TABLET:'互生平板', 
			POINT_MCR:'积分刷卡器',
			CONSUME_MCR:'消费刷卡器',
			P_CARD:'消费者系统资源段',
			NORMAL:'普通工具',
			GIFT:'赠品', 
			SUPPORT:'配套产品'
		},
		//选择要购买的工具名称
		toolManage_toolNameSelect : '请选择要购买的工具',
		//输入购买数量
		toolManage_toolNumNotNull : '请输入要购买工具的申购数量',
		toolManage_consumePoint : '积分刷卡器和消费刷卡器一共',
		//地址类型
		toolManage_addrType : {
			contact:'联系地址',
			ent:'企业地址', 
			auto:'自定义地址'
		},
		//选择收货地址
		toolManage_selectAddr : '请选择收货地址',
		//申购数量不能大于
		toolManage_toolMaxNum : '企业还可以申购{0}的数量为{1}',
		//交易密码不能为空
		gjsg_hsbzf_password : '请输入交易密码',
		//当申购互生卡时 申购数量限制
		toolManage_cardBuyNum : '互生卡购买时必须是1000的整数倍，或一次性申购完剩余的{0}张互生卡！',
		//订单类型
		toolManage_orderType:{
			'109':'申报工具订单',
			'103':'新增工具订单',
			'104':'售后工具维修费',
			'106':'企业重购卡',
			'107':'个性卡定制服务费',
			'110':'申购消费者系统资源 '
		},
		//支付渠道
		toolManage_payChannel:{
			100:'网银支付',
			101:'手机移动支付',
			102:'快捷支付',
			103:'银行卡支付',
			200:'互生币支付',
			400:'转账汇款'
		},
		//订单状态
		toolManage_orderStatus :{
			1:'待付款',
			2:'待配货',
			3:'已完成',
			4:'已过期',
			5:'已关闭',
			6:'已付款',
			7:'已撤单',
			9:'已发货'
		},
		toolManage_waitPay:"待付款",
		//申购类型
		toolManage_applyType :{
			'101':'申报申购工具',
			'103':'新增申购工具',
			'104':'新增售后工具',
			'106':'新增企业重做卡',
			'107':'新增个性卡定制服务',
			'110':'系统资源申购'
		},
		//订单渠道
		toolManage_orderChannel:{
			1:'网页终端',
			2:'POS终端',
			3:'刷卡器终端',
			4:'移动App终端',
			5:'互生平板终端',
			6:'互生系统',
			7:'语音终端',
			8:'第三方接入' 
		},
		//查询订单操作
		toolManage_queryOrderOpt :{
			detail:'查看',
			toPay:'去付款',
			cancelOrder:'取消订单',
			closeOrder:'关闭订单',
			uploadConfirm:'确认文件'
		},
		toolManage_toolOrderCancelSucc :'工具订单取消成功!',
		toolManage_toolOrderCloseSucc :'工具订单关闭成功!',
		//工具设备类型
		toolManage_deviceType:{
			0:'全部',
			1:'POS机',
			2:'刷卡器',
			3:'平板'
		},
		//设备查询操作
		toolManage_queryDeviceOpt :{
			detail:'查看积分比例',
			modifyStatus:'修改属性'
		},
		//设备状态
		toolManage_deviceStatus:{
			1:'启用',
			2:'停用',
			3:'返修',
			4:'冻结'
		},
		//设备操作状态
		toolManage_deviceOptStatus:{
			1:'启用',
			2:'停用'
		},
		toolManage_deviceNotSetPointRatio : '设备未设置积分比例',
		toolManage_modifyDeviceStatusSucc : '修改设备状态成功',
		//银行卡类型
		toolManage_bankCardType :{
			1:'储蓄卡',
			2:'信用卡'	
		},
		toolManage_selectBandQuickBank : '请勾选已经绑定快捷支付的银行卡',
		toolManage_sendSmsSucc : '短信验证码发送成功',
		toolManage_quickPaySucc : '快捷支付提交成功',
		toolManage_quickPayFail : '快捷支付提交失败',
		toolManage_quickPayProcessing : '快捷支付提交处理中',
		pleaseSelectQuick : '请勾选同意快捷支付服务协议',
		hsbAccountBalanceLess :'互生币账户余额不足,请选择其他支付方式',
		accountManage_selectBandQuickBank : '请先绑定快捷支付的银行卡',
		accountManage_quickPaySucc : '快捷支付成功',
		accountManage_quickPayFail : '快捷支付失败',
		accountManage_quickPayProcessing : '快捷支付处理中',
		//卡样操作
		toolManage_cardStyleOpt :{
			detail:'查看',
			uploadFile:'上传素材',
			confirm:'确认设计稿'
		},
		//卡样确认
		toolManage_confirm :{
			'':'待确认',
			'true':'已确认',
			'false':'待确认'
		},
		toolManage_uploadCardStyleSucc:'卡样素材上传成功',
		toolManage_viewCardStyle:'预览互生卡样',
		toolManage_uploadMicroPic:'请上传预览图',
		toolManage_uploadSourceFile:'请上传样板附件',
		toolManage_uploadFileFail:'上传样板附件失败',
		toolManage_remarkLengthIs300:'备注的长度2-300',
		toolManage_cardStyleNameIsNotNull:'卡样名称不能为空',
		toolManage_cardStyleNameLengthIs20:'卡样名称的长度不能超出2-20',
		toolManage_selectedConfirmCheckbox:'请勾选确认设计稿',
		toolManage_confirmCardStyleSucc:'卡样确认成功',
		toolManage_uploadConfirmFile:'请选择要上传的卡样确认文件',
		toolManage_uploadConfirmFileSucc:'卡样确认文件上传成功',
		toolManage_addDeliverAddressSucc:'新增收货地址成功',
		toolManage_removeDeliverAddressSucc:'删除收货地址成功',
		toolManage_modifyDeliverAddressSucc:'修改收货地址成功',
		toolManage_provinceIsNotNull:'请选择所在地区省',
		toolManage_cityIsNotNull:'请选择所在地区城市',
		toolManage_fullAddressIsNotNull:'请填入详细地址',
		toolManage_receiverIsNotNull:'请填入收货人姓名',
		toolManage_mobileIsNotNull:'请填入手机号码',
		toolManage_digits:'请输入整数',
		toolManage_maxLenght:'输入最大长度是{0}',
		toolManage_smsCode:'请填入手机验证码',
		toolManage_bankNo:'请填入银行卡号',
		toolManage_bankNoLength:'银行卡号应为5-30位',
		//设备操作状态
		toolManage_disposeStatus:{
			'false':'未处理',
			'true':'已处理'
		},
		//成员企业资格维护-选择账户
		cyqyzgwh_selectAccount: '请选择账户',
		//申请书
		fileNotNull : '请上传文件!',
		//申请原因
		reasonNotNull : '申请原因不能为空!',
		reasonMax300 : '申请原因不超过300个字',
		//申请提交成功
		apply_post_success : "申请提交成功！",
		//信息保存中
		save_info_ing : "信息保存中.....",
		
		/** 系统业务订单 **/
		//系统业务订单-订单类型 非成员企业
		systemOrderType : {
			'100' : '缴纳系统使用年费'
			//'108' : '预缴积分预付款'
		},
		//系统业务订单-订单类型 成员企业
		systemOrderType2 : {
			'108' : '预缴积分预付款'
		},
		
		detailedTitle:{
			'100' : '缴纳系统使用年费详情',
			'108' : '预缴积分预付款详情'
		},
		//系统业务订单-订单类型
		xtywdd_ddlx : {
			S12104 : '系统使用年费',
			U12105 : '资源费分配',
			P12110 : '兑换互生币',
			S12111 : '购买工具',
			S12112 : '售后服务',
			S12113 : '个人补卡',
			S12114 : '企业重做卡'
		},
		//支付方式
		xtywdd_zffs : {
			1 : '网银支付',
			2 : '互生币支付',
			3 : '货币支付',
			4 : '转账汇款'
		},
		//订单状态
		xtywdd_ddzt : {
			1 : '待付款',
			2 : '待配货',
			3 : '已完成',
			4 : '已过期',
			5 : '已关闭'
		},
		//支付状态
		payStatus:{
			0:'待付款',
			1:'支付处理中',
			2:'已付款',
			3:'支付失败'
		},
		orderChannel:{
			1 : '网页终端',
			2 : '移动终端',
			3 : '经营平台',
			4 : 'POS终端'
		},
		xtywdd_ckxq : '查看详情',
		xtywdd_ck : '查看',
		xtywdd_wcfk : '完成付款',
		xtywdd_xzzffs : '选择支付方式',
		pointrate : '积分比例不能为空',
		pointNum : '积分比例应为数字',
		pointRange: '积分比例为{0}至0.3',
		pointLengthRange: '积分比例最多4位小数',
		resNoP:'请输入持卡人的互生号',
		wsdjjfSuccess:'网上登记积分成功',
		point_activity_apply_success:"贵企业已于 {0} 提交了参与积分活动申请，请耐心等待！",
		//发票配送类型
		delivery_status : {
			0:  "全部",
			2:  "已开票",
			3 : "已配送",
			4 : "已签收 ",
			5 : "拒签"
		},
		invoice_status : {
			0 : "申请中",
			1 : "审批驳回 ",
			2 : "已开票 ",
			3 : "已配送 ",
			4 : "已签收 ",
			5 : "拒签"
		},
		post_way : {
			0 : "快速配送 ",
			1 : "自由配送 "
		},
		receive_way : {
			0 : "物流单号确认签收 ",
			1 : "电话确认签收 ",
			2 : "到期自动签收"
		},
		invoice_type : {
			1 : "增值税普通发票 ",
			0 : "增值税专用发票 "
		},
		bizType :{
			'PC001' : '服务公司系统资源费',
			'PC002' : '申购工具金额（新增申购）',
			'PC003' : '系统使用年费',
			'PC005' : '消费积分使用累计金额',
			'PC006' : '个性卡制定服务费',
			'PC007' : '成员企业系统资源费',
			'PC008' : '首段托管企业系统资源费',
			'PC009' : '创业托管企业系统资源费',
			'PC010' : '托管企业系统资源费(全部资源)',
			'PC011' : '其他段托管企业系统资源费'
		},
		quickDateEnum : {// 快捷日期类别
			'today' : '今天',
			'week' : '本周',
			'month' : '本月'
		},
		dhhsb : {
			'100' : "您输入的卡号无效",
			'003' : "您的发卡银行不支持该商户，请更换其他银行卡",
			'006' : "您的卡已经过期，请使用其他卡支付",
			'011' : "您卡上的余额不足",
			'014' : "您的卡已过期或者是您输入的有效期不正确",
			'015' : "您输入的银行卡密码有误",
			'021' : "您输入的验证信息有误",
			'039' : "您已连续多次输入错误密码",
			'040' : "您的银行卡暂不支持在线支付业务，请向您的银行咨询如何加办银联在线支付",
			'041' : "您的银行不支持快捷支付",
			'042' : "您的银行不支持小额支付",
			'043' : "您的银行不支持快捷支付",
			'057' : "该银行卡未开通银联在线支付业务",
			'060' : "银行卡未开通快捷支付",
			'074' : "对不起，该操作只能在交易当日进行",
			'084' : "验证码错误或者已失效，请重新获取验证码",
			'085' : "不支持短信发送",
			'086' : "短信验证码错误",
			'087' : "您的短信发送过于频繁，请稍候再试",
			'088' : "您的短信发送累计过于频繁，请在5分钟后重试",
			'089' : "对不起，短信发送失败，请稍候再试",
			'095' : "您尚未在邮储银行网点柜面或个人网银签约加办银联无卡支付业务，请去柜面或网银开通",
			'097' : "请致电您的银行以确定您的用户信息是否设置正确，并咨询是否已经开办银联在线支付"
		},
		selectPostWay:"请选择配送方式",
		mustGtZero:"开发票金额需大于0",
		enterExpressName:"请输入承运公司",
		entertrackingNo:"请输入运单号",
		confirCyjfhd:"确认申请参与积分活动？",
		fullAddressLentgh:'详细地址长度应为2~128个字',
		consigneeNameLentgh:'收货人名称长度应为2~20个字',
		pleaseInputLoginPwd:"请输入登录密码",
		loginPwdIsSixLength:"登录密码的长度是6位",
		31129: "您互生币账户余额不足,代兑互生币操作失败",
		31130:"兑换互生币金额大于持卡人的最大单笔兑换金额，代兑互生币操作失败！",
		31131: "兑换互生币金额已超过持卡人单日最大兑换金额，代兑互生币操作失败！",
		31132:"兑换互生币金额小于持卡人的最小单笔兑换金额，代兑互生币操作失败！",
		31133: "兑换互生币金额已超过持卡人单日最大兑换金额，代兑互生币操作失败",
		pleaseSelectAgreement:"请先勾选托管企业系统消费者资源协议",
		pleaseSelectSegment:"请先勾选托管企业系统消费者资源段",
		pleaseSelectCardStyle:"请先选择卡制作卡样",
		31137: "工具参数不能为空",
		31138: "申购消费资源段不能为空",
		31139: "申购消费资源段价格错误",
		31140: "申购消费资源段资源数量错误",
		31141:"企业开启资源类型是全部资源",
		isSubmitCardStyleOrder:'是否申请个性互生卡定制服务下单',
		isSubmitUpLoadCardStyle:'是否上传个性互生卡定制服务素材',
		contactAddrIsNull:'联系地址为空,请完善企业系统信息中联系信息的联系地址或选择其他的地址',
		12492:'工具订单已关联临账,不允许关闭订单',
		12344 : "发票已签收,请勿重复签收",
		31144 : '互生个性卡样名称不能为空',
		12220: "选择资源段含有已下单或已申购",
		12222:"申购资源段订单提交失败",
	}
});