define([ "commSrc/comm" ], function() {
	comm.langConfig['accountManage'] = {
		// 共用
		22000 : "操作成功",
		22001 : "操作失败",
		22003 : "参数错误",
		23901 : "参数错误",
		22004 : "token令牌无效",
		0 : "处理成功",
		160355 : "参数错误，请稍后再试！",
		160360 : "交易密码不正确",
		160415 : "交易密码未设置",
		160146 : "数据解密错误",
		160411 : "交易密码连续出错导致用户锁定",
		43301 : "转账失败",
	    43302 : "银行账户名称与注册姓名不一致",
	    43303 : "转账失败",
		requestError : '请求出错，请重试！',
		digits : '请输入整数',
		maxlength : '最多输入{0}个字',
		begin_Date : '请输入开始日期',
		end_Date : '请输入结束日期',
		kjrq : '请选择快捷日期',
		ywlb : '请选择业务类别',
		businessEnum : {// 业务类别
			0 : '全部',
			1 : '收入',
			2 : '支出',
		},
		quickDateEnum : {// 快捷日期类别
			'today' : '今天',
			'week' : '最近一周',
			'month' : '最近一月'
		},
		// 互生币类型
		hsbAccTypeEnum : {
			"20110" : "流通币",
			"20130" : "慈善救助基金"
		},
		
		// 交易类型
		transTypeEnum : {
			"M71000" : "积分转货币",
			"L23000" : "货币转银行",
			"L43000" : "货币转银行手续费",
			"L23100" : "货币转银行撤单",
			"L43100" : "企业转账银行退票退回",
			"L23200" : "货币转银行失败转入",
			"L43200" : "货币转银行失败转入",
			"G20000" : "消费积分分配",
			"U46000" : "管理费收入",
			"X10630" : "系统调账转出",
		    "X10530" : "系统调账转入",
		    "S72000" : "平台业务扣款",
		    "X11000" : "系统平账",
		    "X14000" : "系统平账",
		}
	}
});
